Repository: 84000/data-translation-memory
Catalog: toh556-v3.tmx
Source language: bo
Languages: en

source: མངོན་སུམ་དུ་བྱང་ཆུབ་སེམས་དཔར་ངེས་པ། ཚེའི་རིག་བྱེད་ཡན་ལག་བརྒྱད་པ་ཐམས་ཅད་རྟོགས་པ་ཞེས་མངོན་པར་འདུ་བྱེད་དོ། །
en: He is the visible presence of a bodhisattva, and he knows all the eight branches of the Āyurveda.’

source: རིགས་ཀྱི་ལྷ་མོ། །ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་དེ་ལ་ཆུང་མ་ཆུའི་པདྨའི་སྙིང་པོ་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: “Noble goddess, Jalavāhana, the head merchant’s son, had a wife by the name of Jalāmbujagarbhā.

source: རིགས་ཀྱི་ལྷ་མོ་ཆུའི་པདྨའི་སྙིང་པོ་དེ་ལ་ཁྱེའུ་གཉིས་ཡོད་དེ།
en: “Noble goddess, the wife, Jalāmbujagarbhā, had two sons.

source: གཅིག་གི་མིང་ནི་ཆུའི་གོས་ཞེས་བྱ། གཅིག་གི་མིང་ནི་ཆུའི་སྙིང་པོ་ཞེས་བྱའོ། །
en: The name of one was Jalāmbara and the name of the other was Jalagarbha.

source: རིགས་ཀྱི་ལྷ་མོ་དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ཆུ་འབེབས་ཀྱིས་ཁྱེའུ་དེ་གཉིས་དང་ལྷན་ཅིག་ཏུ་མཐར་གྱིས་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཡུལ་འཁོར་དང་།
en: “Noble goddess, Jalavāhana, the head merchant’s son, traveled with his two sons successively through the villages, towns, market towns, countryside, realm, and the royal capital.

source: རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་རྣམས་སུ་འགྲོའོ། །རིགས་ཀྱི་ལྷ་མོ་དེ་ནས་དུས་གཞན་ཞིག་ན། ཚོང་དཔོན་གྱི་བུ་ཆུ་འབེབས་འབྲོག་ཁོང་ཁོང་ཞིག་ཏུ་ཕྱིན་ཏོ། །དེ་ནས་འབྲོག་ཁོང་ཁོང་དེར་ཤ་ཟ་བའི་ཁྱི་དང་།
en: “Noble goddess, at another time, Jalavāhana, the head merchant’s son, went into an empty wilderness.

source: སྤྱང་ཀི་དང་། ཝ་དང་། ཁྭ་དང་། བྱ་དག་འབྲོག་ཁོང་ཁོང་ན་རྫིང་ཞིག་ཡོད་པ་ག་ལ་བ་དེར་རྒྱུག་པ་མཐོང་ནས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། ཅིའི་ཕྱིར་ཤ་ཟ་བའི་ཁྱི་དང་།
en: In that empty wilderness he saw carnivores—dogs, jackals, crows, and other birds—that were hurrying toward a lake in that wilderness, and he wondered, ‘Why are these carnivores—dogs, jackals, and so on, up to birds—hurrying in that direction?’

source: སྤྱང་ཀི་ནས་བྱའི་བར་དག་འདི་དག་ཕྱོགས་འདིར་རྒྱུག་སྙམ་མོ། །དེ་ནས་ཡང་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་ཁྱི་དང་། སྤྱང་ཀི་དང་། ཝ་དང་།
en: Then he also thought, ‘I will go in the direction that the dogs, jackals, crows, and other birds are rushing.’

source: ཁྭ་དང་། བྱ་རྣམས་ཕྱོགས་གང་དུ་རྒྱུག་པའི་ཕྱོགས་དེར་འགྲོ་བར་བྱའོ་སྙམ་མོ། །རིགས་ཀྱི་ལྷ་མོ་དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ཆུ་འབེབས་མཐར་གྱིས་རྒྱུ་ཞིང་སོང་སོང་ནས། འབྲོག་ཁོང་ཁོང་ན་རྫིང་ཞིག་ག་ལ་ཡོད་པ་དེར་ཕྱིན་ཏོ། །
en: “Noble goddess, then Jalavāhana, the head merchant’s son, went along in that way until he eventually came to the lake in the empty wilderness where they were going.

source: རྫིང་ཆེན་པོ་དེ་ན་ཉ་ཁྲི་ཞིག་གནས་ཏེ།
en: Ten thousand fish lived in that great lake.

source: དེས་དེར་ཉ་བརྒྱ་ཕྲག་མང་པོ་ཞིག་ཆུ་དང་བྲལ་བ་མཐོང་ནས། དེས་དེ་ལ་སྙིང་རྗེ་བའི་སེམས་སྐྱེས་པ་དང་།
en: He saw that many hundreds of the fish had no water and he felt great compassion for them.

source: དེ་ན་ལྷ་མོ་ཞིག་ཤིང་ལས་ལུས་ཕྱེད་ཙམ་ཕྱུང་བ་ཞིག་མཐོང་སྟེ།
en: Then he saw emerging from a tree the upper half of the body of a goddess.

source: ལྷ་མོ་དེས་ཚོང་དཔོན་གྱི་བུ་ཆུ་འབེབས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ལེགས་སོ་ལེགས་སོ། །
en: The goddess said to Jalavāhana, the head merchant’s son, ‘Excellent, noble son, excellent.

source: གང་གི་ཕྱིར་ཆུ་འབེབས་ཞེས་བྱ་བ་ཁྱོད་ཀྱིས་ཉ་འདི་རྣམས་ལ་ཆུ་བྱིན་ཅིག །
en: Why is that? Because your name is Jalavāhana you must give water to these fish.

source: རྣམ་པ་གཉིས་ཀྱི་ཕྱིར་ཆུ་འབེབས་ཞེས་བྱ་སྟེ། གང་ཆུ་འབེབས་དང་གང་ཆུ་སྦྱིན་པའོ། །
en: You are called Jalavāhana for two reasons, because you bring water and because you give water.

source: དེ་བས་ན་རང་གི་མིང་དང་མཐུན་པའི་བྱ་བ་བྱོས་ཤིག །
en: Therefore act in accordance with your name!’

source: ཆུ་འབེབས་ཀྱིས་སླར་སྨྲས་པ། ལྷ་མོ་ཉ་འདི་དག་ལ་ཉ་ཇི་སྙེད་ཅིག་མཆིས།
en: “Jalavāhana asked the goddess, ‘Goddess, how many of these fish are there?’

source: ལྷ་མོས་སྨྲས་པ། ཉ་ཁྲི་ཐམ་པའོ། །
en: “The goddess replied, ‘A full ten thousand fish.’

source: རིགས་ཀྱི་ལྷ་མོ་དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ཆུ་འབེབས་ཆེར་མཆོག་ཏུ་སྙིང་རྗེ་བའི་སེམས་སྐྱེས་སོ། །
en: “Then, noble goddess, Jalavāhana, the head merchant’s son, developed an even greater motivation of compassion.

source: རིགས་ཀྱི་ལྷ་མོ་དེའི་ཚེ། འབྲོག་ཁོང་ཁོང་ན་ཡོད་པའི་རྫིང་ཆེན་པོ་ན་ཆུའི་ལྷག་མ་ཅུང་ཟད་ཙམ་ཞིག་ལུས་ཏེ། དེ་ནས་ཉ་ཁྲི་འཆི་བའི་སྒོར་ཞུགས་ཤིང་ཆུ་དང་བྲལ་བ་དེ་དག་རྒྱུག་ཅིང་རྣམ་པར་རྒྱུག་གོ། །
en: “Noble goddess, at that time, there was just a little water left in that great lake in the empty wilderness, and those ten thousand fish were close to death, deprived of water, and rushing and darting around.

source: རིགས་ཀྱི་ལྷ་མོ་དེ་ནས་ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་ཀྱིས་ཕྱོགས་བཞིར་བརྒྱུགས་པ་དང་།
en: “Noble goddess, Jalavāhana, the head merchant’s son, ran in all four directions.

source: ཉ་ཁྲི་པོ་དེ་དག་ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་ཕྱོགས་གང་དུ་འགྲོ་བའི་ཕྱོགས་དེ་ལོགས་སུ་ཆུ་འབེབས་ལ་སྙིང་རྗེ་རྗེ་ལྟར་བ་ལྟའོ། །
en: In whatever direction Jalavāhana, the head merchant’s son, went, those ten thousand fish looked piteously in that direction at Jalavāhana.

source: རིགས་ཀྱི་ལྷ་མོ་དེ་ནས་ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་ཀྱིས་ཕྱོགས་བཞིར་བརྒྱུགས་ཏེ། ཆུ་བཙལ་ཀྱང་དེར་ཆུ་མ་རྙེད་ནས་ཕྱོགས་བཞིར་བལྟས་པ་དང་། དེས་ཧ་ཅང་ཡང་ཐག་མི་རིང་བ་ཞིག་ན་ཤིང་ལྗོན་པ་ཆེན་པོ་མང་པོ་ཞིག་མཐོང་ནས་ཤིང་ལྗོན་པ་དེ་དག་ལ་འཛེགས་ཏེ།
en: “Noble goddess, Jalavāhana, the head merchant’s son, again ran in all four directions but did not find water, so then he looked into the four directions and saw many trees that were not very far away.

source: ཤིང་གི་ཡལ་ག་རྣམས་བཅད་ནས།
en: He climbed those trees and cut off branches.

source: ཤིང་གི་ཡལ་ག་དེ་དག་ཁྱེར་ཏེ། རྫིང་ཆེན་པོ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། ཤིང་གི་ཡལ་ག་དེ་རྣམས་ཀྱིས་ཉ་ཁྲི་པོ་དེ་དག་ལ་ཤིན་ཏུ་བསིལ་བའི་གྲིབ་མར་བྱས་སོ། །
en: Carrying those tree branches, he went back to the great lake, and there he created a very cool shade for those ten thousand fish.

source: རིགས་ཀྱི་ལྷ་མོ་དེ་ནས་ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་རྫིང་དེར་ཆུ་འབབ་པ་ཚོལ་ཏེ།
en: “Then, noble goddess, Jalavāhana, the head merchant’s son, went searching for the river that flowed into that lake.

source: གང་ནས་ཆུ་འབབ་ཅེས་ཕྱོགས་བཞིར་བརྒྱུགས་ཀྱང་ཆུ་མ་རྙེད་ནས།
en: Wherever he ran in the four directions, he did not find the river that flowed into the lake.

source: དེར་མྱུར་བ་མྱུར་བར་ཆུའི་རྒྱུན་དེ་ཉིད་ཀྱི་སྲོལ་དུ་སོང་སྟེ།
en: He hurriedly followed a dried-up riverbed.

source: རིགས་ཀྱི་ལྷ་མོ་འབྲོག་ཁོང་ཁོང་ན་ཡོད་པའི་རྫིང་དེར། ཆུ་འབབ་པ་ཞེས་བྱ་བའི་ཆུ་ཀླུང་ཆེན་པོ་དེ་ལས་དེར་ཆུ་འབབ་པའི་ཀླུང་དེ་ཡང་དེའི་ཚེ།
en: There was a great river called Jalāgamā, and it was the waters of that river that had flowed into that lake in the empty wilderness.

source: སྡིག་པ་ཅན་གྱི་སེམས་ཅན་ཞིག་གིས་ཉ་ཁྲི་པོ་དེ་དག་གི་ཕྱིར་ཅི་ནས་ཀྱང་ཕྱིས་ཉ་དེ་དག་ལ་ཆུ་འབབ་པར་མི་འགྱུར་བ་དེ་ལྟ་བུའི་ཕྱོགས་ཀྱི་གྲོག་པོ་ཆེན་པོར་ཀླུང་དེ་ཕབ་བོ། །
en: At that time, a wicked being, in order to obtain those ten thousand fish, had caused the river to flow into a great ravine in that area so that subsequently there would be no water flowing to the fish.

source: དེས་དེ་མཐོང་ནས་བསམས་པ་ཀླུང་འདི་ནི་སྐྱེ་བོ་སྟོང་གིས་ཀྱང་། སྲོལ་དེ་ཉིད་དུ་དབབ་པར་མི་ནུས་ན།
en: When Jalavāhana, the head merchant’s son, saw that, he thought, ‘Not even a thousand people could make the course of this river flow to that lake, so how would I alone be able to?’

source: བདག་གིས་ལྟ་དབབ་པར་ག་ལ་ནུས་སྙམ་ནས་དེ་ཕྱིར་ལོག་གོ། །
en: He then returned.

source: རིགས་ཀྱི་ལྷ་མོ་དེ་ནས་ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་རིངས་པ་རིངས་པར་རྒྱལ་པོ་ལྷའི་དབང་ཕྱུག་འོད་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: “Then, noble goddess, Jalavāhana, the head merchant’s son, hurriedly went to King Sureśvaraprabha.

source: རྒྱལ་པོ་ལྷའི་དབང་ཕྱུག་འོད་ཀྱི་རྐང་པ་ལ་མགོ་བོས་མཆོད་དེ་ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་དེ་དག་རྒྱུས་ཀྱིས་སྨྲས་ཏེ། བདག་གིས་ལྷའི་ཆགས་འོག་ཏུ་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་ཐམས་ཅད་དུ་སེམས་ཅན་རྣམས་ཀྱི་ནད་ཀྱི་རྒྱུན་ནི་བཀུམ་ན།
en: Having reached him, he bowed down his head to the feet of King Sureśvaraprabha, seated himself in one direction, and told his story: ‘I had eliminated illness in all the villages, towns, and market towns within Your Majesty’s domain.

source: གནས་ཆེ་གེ་མོ་ཞེས་བགྱི་བ་དེ་ན་འབྲོག་ཁོང་ཁོང་ན་ཡོད་ཅེས་བགྱི་བའི་རྫིང་ཞིག་མཆིས་པ་དེ་ན།
en: In a certain place, there is a lake called Aṭavīsaṃbhavā, in which live ten thousand fish.

source: ཉ་ཁྲི་ཞིག་གནས་པ་ཆབ་དང་བྲལ་ནས་གདུགས་ཀྱིས་གདུངས་ཤིང་མཆིས་ཏེ།
en: They lack water and are being tormented by the sun.

source: ཇི་ལྟར་མི་རྣམས་ལ་སྩལ་བ་ལྟར་ཅི་ནས་དུད་འགྲོའི་སྐྱེ་གནས་སུ་གྱུར་པ། དེ་དག་ལ་ཡང་སྲོག་སྩོལ་བར་འཚལ་ན།
en: Just as I did for human beings, I wish to save the lives of those who have been born as animals.

source: ལྷས་གླང་པོ་ཆེ་ཉི་ཤུ་ཞིག་བདག་ལ་སྩལ་དུ་གསོལ།
en: Therefore, Your Majesty, I request twenty elephants from you.’

source: རྒྱལ་པོ་ལྷའི་དབང་ཕྱུག་འོད་ཀྱིས། སྨན་པའི་རྒྱལ་པོ་ཆེན་པོ་ལ་གླང་པོ་ཆེ་ཉི་ཤུ་ཞིག་བྱིན་ཅིག་ཅེས་བློན་པོ་རྣམས་ལ་བསྒོའོ། །
en: “King Sureśvaraprabha gave his ministers the command: ‘Give the great king of doctors twenty elephants!’

source: བློན་པོ་རྣམས་ཀྱིས་སྨྲས་པ།
en: “The ministers said to him, ‘Great being!

source: སེམས་ཅན་ཆེན་པོ་གླང་པོ་ཆེའི་ལྷས་ག་ལ་བར་སོང་ལ་གླང་པོ་ཆེ་ཉི་ཤུ་ཁྲིད་དེ་སེམས་ཅན་རྣམས་ལ་ཕན་གདགས་པ་དང་། བདེ་བ་གྱིས་ཤིག །
en: Go to the elephant pen, take away twenty elephants, and bring benefit and happiness to beings!’

source: རིགས་ཀྱི་ལྷ་མོ་དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ཁྱེའུ་ཆུ་འབེབས་རང་གི་བུ་ཆུའི་གོས་དང་། ཆུའི་སྙིང་པོ་དང་ལྷན་ཅིག་ཏུ། གླང་པོ་ཆེ་ཉི་ཤུ་ཁྲིད་ནས། གླང་པོ་ཆེའི་རྫི་བོ་ལས་བ་ལང་གི་རྐྱལ་པ་བརྒྱ་བླངས་ཏེ། སླར་ལོག་ནས་ཆུ་འབབ་ཅེས་བྱ་བའི་ཀླུང་ཆེན་པོ་གང་དུ་འབབ་པ་དེར་སོང་སྟེ།
en: “Then, noble goddess, Jalavāhana, the head merchant’s son, with his sons Jalāmbara and Jalagarbha, led away twenty elephants and obtained from the elephant keepers one hundred ox-leather bags, and then they returned, going to where great river Jalāgamā flowed.

source: རྐྱལ་པ་དེ་དག་ཆུས་བཀང་ནས། གླང་པོ་ཆེའི་རྒྱབ་ཏུ་ཆུ་བཀལ་ཏེ། མྱུར་བ་མྱུར་བར་འབྲོག་ཁོང་ཁོང་ན་ཡོད་པའི་རྫིང་ག་ལ་བ་དེར་སོང་ནས་ཕྱིན་པ་དང་ཆུ་དེ་གླང་པོ་ཆེའི་སྟེང་ནས་ཕབ་སྟེ།
en: They filled those bags with water, loaded them onto the elephants, and hurried back to the lake in the empty wilderness.

source: ཕྱོགས་བཞི་ནས་རྫིང་བུ་ཆུས་བཀང་ནས། ཕྱོགས་བཞིར་འགྲོ་བ་དང་།
en: When they had arrived there, they took down the water from the elephants, and from all four directions they filled the lake with water.

source: ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་གང་དང་གང་དུ་འགྲོ་བའི་དེ་དང་དེ་ལོགས་སུ་ཉ་ཁྲི་པོ་དེ་དག་རྒྱུག་གོ། །
en: As Jalavāhana, the head merchant’s son, walked in the four directions, wherever he went, the ten thousand fish sped there.

source: རིགས་ཀྱི་ལྷ་མོ་དེ་ནས་ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་འདི་སྙམ་དུ་སེམས་ཏེ། ཅིའི་ཕྱིར་ཉ་ཁྲི་པོ་འདི་དག་བདག་ག་ལ་བ་དེ་ལོགས་སུ་རྒྱུག་སྙམ་མོ། །
en: “Then, noble goddess, Jalavāhana, the head merchant’s son, wondered, ‘Why are the ten thousand fish speeding to wherever I am?’

source: དེ་ཡང་འདི་སྙམ་དུ་སེམས་ཏེ། ཉ་ཁྲི་པོ་འདི་དག་ནི་བཀྲེས་པའི་མེས་ཡོངས་སུ་ཉེན་ནས། བདག་ལ་བཟའ་བ་སློང་དུ་ངེས་ཀྱིས། བདག་གིས་ཁ་ཟས་སྦྱིན་པར་བྱའོ་སྙམ་ནས།
en: He also thought, ‘These ten thousand fish are definitely tormented by the fire of hunger and are begging me for food, so I will give them food.’

source: རིགས་ཀྱི་ལྷ་མོ་དེ་ནས་ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་ཀྱིས་རང་གི་བུ་ཆུའི་གོས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བུ་གླང་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ནང་ན་མགྱོགས་པའི་མཆོག་ལ་ཞོན་ཏེ། བདག་ཅག་གི་ཁྱིམ་དུ་མྱུར་བ་མྱུར་བར་སོང་སྟེ། མེས་པོ་ཚོང་དཔོན་ལ། ཀྱེ་མེས་པོ་ཆུ་འབེབས་ཀྱི་མཆིད་ནས། ཁྱིམ་འདི་ན་ཕ་མ་དང་། སྤུན་དང་། སྲིང་མོ་དང་། བྲན་ཕོ་དང་།
en: “Then, noble goddess, Jalavāhana, the head merchant’s son, said to his son Jalāmbara, ‘Mount the fastest of all these elephants ride as quickly as you can to our home, and say to your grandfather, the head merchant, “O grandfather, Jalavāhana has said, ‘Put together as one all the food that my parents, brothers, sisters, male servants, female servants, and workmen have at home, and send it to me quickly in the hands of Jalāmbara riding the elephant!’ ” ’

source: བྲན་མོ་དང་། ལས་བགྱིད་པ་རྣམས་ཀྱི་ཁ་ཟས་སྦྱར་བ་གང་ཅི་མཆིས་པ་ཐམས་ཅད་གཅིག་ཏུ་བསྡུས་ཏེ། ཆུའི་གོས་གླང་པོ་ཆེ་ལ་ཞོན་པའི་ལག་ཏུ་མྱུར་བར་རྫོངས་ཤིག་ཅེས་མཆིའོ་ཞེས་དེ་སྐད་གྱིས་ཤིག །དེ་ནས་ཁྱེའུ་ཆུའི་གོས་གླང་པོ་ཆེ་དེ་ལ་ཞོན་ནས་མྱུར་བ་མྱུར་བར་རྒྱུག་ཅིང་རབ་ཏུ་རྒྱུག་སྟེ། རང་གི་ཁྱིམ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་།
en: “Then the boy Jalāmbara, riding that elephant, rode and galloped as quickly as he could and came to his home.

source: དེ་དག་རྒྱུས་ཀྱིས་ཞིབ་ཏུ་སྨྲས་ཏེ།
en: When he had arrived there, he told his story in detail.

source: དེ་ནས་ཁྱེའུ་ཆུའི་གོས་ཀྱིས་སྔར་སྨོས་པའི་ཟས་སྦྱར་བ་དེ་དག་ཐམས་ཅད་གླང་པོ་ཆེའི་རྒྱབ་ཏུ་བཀལ་ནས་གླང་པོ་ཆེ་དེ་ལ་ཞོན་ཏེ། འབྲོག་ཁོང་ཁོང་ན་ཡོད་པའི་རྫིང་ག་ལ་བ་དེར་སོང་བ་དང་།
en: Then the boy Jalāmbara loaded onto the elephant all that combined food that he had been told to obtain, and he rode that elephant to the lake in the empty wilderness.

source: ཆུ་འབེབས་ཀྱིས་རང་གི་བུ་ཆུའི་གོས་མཐོང་ནས་དགའ་མགུ་སྟེ། བུ་ལས་ཟས་བླངས་ནས་ཕྲུལ་ཏེ་རྫིང་དེར་གཏོར་ནས། ཉ་ཁྲི་པོ་དེ་དག་ཚིམ་པར་བྱས་ཏེ།
en: “Jalavāhana was delighted to see his son Jalāmbara, received the food from his son, divided it, and scattered it in the lake, satisfying those ten thousand fish.

source: དེ་འདི་སྙམ་དུ་བདག་གིས་དུས་གཞན་ཞིག་ན་དགོན་པའི་གནས་ཤིག་ན། དགེ་སློང་ཐེག་པ་ཆེན་པོ་ཀློག་པ་ལས་ཐོས་ན་སུ་འཆི་བའི་དུས་ཀྱི་ཚེ། དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་གཙུག་ཏོར་ཅན་གྱི་མཚན་ཐོས་པ་དེ་བདེ་འགྲོ་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་སྐྱེའོ་ཞེས་ཐོས་ཀྱིས།
en: “He thought, ‘At another time, in a solitary place, I heard from a bhikṣu reading the Mahāyāna that someone who hears the name of the Tathāgata Ratnaśikhin at the time of death will be reborn in a happy existence in a higher world.

source: བདག་གིས་ཉ་དེ་དག་ལ་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་ཆོས་ཟབ་མོ་ཡང་བཤད་ལ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་དེའི་མཚན་ཀྱང་བསྒྲག་པར་བྱའོ་སྙམ་མོ། །
en: So I will teach the fish the profound Dharma of dependent origination and also recite the name of the tathāgata arhat samyaksaṃbuddha Ratnaśikhin.’

source: དེའི་ཚེ་འཛམ་བུའི་གླིང་དེ་ན། སེམས་ཅན་རྣམས་ཀྱི་ལྟ་བ་གཉིས་སུ་གྱུར་ཏེ།
en: “At that time, the beings in Jambudvīpa had two views.

source: ཁ་ཅིག་ནི་ཐེག་པ་ཆེན་པོ་ལ་མངོན་པར་ད་དོ། །ཁ་ཅིག་ནི་སྨོད་དོ། །
en: Some had faith in the Mahāyāna and some disparaged it.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ཆུ་འབེབས་ཀྱིས་དེའི་ཚེ་རྫིང་དེར་རྐང་པ་གཉི་གའི་པུས་མོ་ནུབ་ཙམ་དུ་འབོགས་ཏེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་དེ་ལ་ཕྱག་འཚལ་ལོ་ཞེས་ཆེད་དུ་བརྗོད་པ་དེ་སྐད་དུ་ཆེད་དུ་བརྗོད་དོ། །
en: “Then, at that time, Jalavāhana, the head merchant’s son, stood in the lake up to his knees and recited: ‘Homage to the tathāgata arhat samyaksaṃbuddha Ratnaśikhin.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་གཙུག་ཏོར་ཅན་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། ཕྱོགས་བཅུ་དག་ན་གང་སུ་དག་འཆི་བའི་དུས་ཀྱི་ཚེ་ངའི་མིང་ཐོས་པ་དེ་དག་དེ་ནས་ཤི་འཕོས་ནས་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་དང་སྐལ་བ་མཉམ་པར་སྐྱེ་བར་གྱུར་ཅིག་ཅེས་སྨོན་ལམ་དེ་སྐད་ཅེས་བཏབ་བོ། །
en: Previously, when the Tathāgata Ratnaśikhin was practicing bodhisattva conduct, he made this prayer: “May anyone in the ten directions who hears my name at the time of their death, after their passing be reborn with the good fortune of becoming devas in Trāyastriṃśa.” ’

source: དེ་ནས་ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་ཀྱིས་དུད་འགྲོའི་སྐྱེ་གནས་སུ་གྱུར་པ་དེ་དག་ལ་ཆོས་འདི་བཤད་དེ། འདི་ལྟ་སྟེ། འདི་ཡོད་པའི་ཕྱིར་འདི་འབྱུང་། འདི་སྐྱེས་པས་འདི་སྐྱེ་བ་སྟེ། འདི་ལྟ་སྟེ། མ་རིག་པའི་རྐྱེན་གྱིས་འདུ་བྱེད་རྣམས། འདུ་བྱེད་ཀྱི་རྐྱེན་གྱིས་རྣམ་པར་ཤེས་པ།
en: “Then Jalavāhana, the head merchant’s son, taught this Dharma to those who had been reborn as animals: ‘Because this exists, that is produced; because this is born, that is born.

source: རྣམ་པར་ཤེས་པའི་རྐྱེན་གྱིས་མིང་དང་གཟུགས། མིང་དང་གཟུགས་ཀྱི་རྐྱེན་གྱིས་སྐྱེ་མཆེད་དྲུག །སྐྱེ་མཆེད་དྲུག་གི་རྐྱེན་གྱིས་རེག་པ། རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ། ཚོར་བའི་རྐྱེན་གྱིས་སྲེད་པ། སྲེད་པའི་རྐྱེན་གྱིས་ལེན་པ། ལེན་པའི་རྐྱེན་གྱིས་སྲིད་པ། སྲིད་པའི་རྐྱེན་གྱིས་སྐྱེ་བ། སྐྱེ་བའི་རྐྱེན་གྱིས་རྒ་ཤི་དང་། མྱ་ངན་དང་།
en: In that way, because of the factor of ignorance, there is formation; because of the factor of formation, there is consciousness; because of the factor of consciousness, there is name and form; because of the factor of name and form, there are the six āyatanas; because of the factor of the six āyatanas, there is contact; because of the factor of contact, there is sensation; because of the factor of sensation, there is craving; because of the factor of craving, there is grasping; because of the factor of grasping, there is becoming; because of the factor of becoming, there is birth; because of the factor of birth, there is old age, death, misery, lamenting, suffering, unhappiness, and distress.

source: སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་འབྱུང་བར་འགྱུར་ཏེ། དེ་ལྟར་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཆེན་པོ་འབའ་ཞིག་པོ་འདི་དག་འབྱུང་བར་འགྱུར་རོ། །
en: In that way there is produced this great mass of nothing but suffering.

source: འདི་ལྟ་སྟེ། མ་རིག་པ་འགགས་པས་འདུ་བྱེད་རྣམས་འགག་པར་འགྱུར་བ་ནས། དེ་ལྟར་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཆེན་པོ་འབའ་ཞིག་པོ་འདི་ཡང་འགག་པར་འགྱུར་རོ་ཞེས་བྱ་བའི་བར་དུའོ། །
en: “ ‘Thus, through the cessation of ignorance, formation ceases, and so on, until in that way this great mass of nothing but suffering ceases.’

source: རིགས་ཀྱི་ལྷ་མོ་དེ་ལྟར་དེའི་ཚེ་དེའི་དུས་ན། ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་ཀྱིས་དུད་འགྲོའི་སྐྱེ་གནས་སུ་གྱུར་པ་དེ་དག་ལ། ཆོས་དང་ལྡན་པའི་གཏམ་འདི་བརྗོད་ནས། རང་གི་བུ་ཆུའི་གོས་དང་།
en: “Noble goddess, in that way, at that time, in that time, Jalavāhana, the head merchant’s son, recited those words of the Dharma to those who had been reborn as animals.

source: ཆུའི་སྙིང་པོ་དང་ལྷན་ཅིག་ཏུ་རང་གི་ཁྱིམ་དུ་ཕྱིན་པའི་བར་དུའོ། །
en: Then, together with his sons, Jalāmbara and Jalagarbha, he returned to his home.

source: དེ་ནས་དུས་གཞན་ཞིག་ན། ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་དུས་སྟོན་ཆེན་པོ་ཟོས་ནས་ཆང་གིས་ར་རོ་སྟེ་མལ་ན་ཉལ་བ་དང་།
en: “At another time, Jalavāhana, the head merchant’s son, ate a great feast and became intoxicated from alcohol, and then went to sleep in his bed.

source: དེའི་ཚེ་དེའི་དུས་ན། ལྟས་ཆེན་པོ་བྱུང་བར་གྱུར་ཏེ།
en: At that time, in that time, there appeared a great omen.

source: མཚན་མོ་དེ་འདས་པ་དང་། ཉ་ཁྲི་པོ་དེ་དག་འཆི་བའི་དུས་བྱས་པར་གྱུར་ནས། སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་དང་སྐལ་བ་མཉམ་པར་སྐྱེས་སོ། །
en: When that night had passed, it was time for the ten thousand fish to die, and they were reborn with the good fortune of becoming devas in Trāyastriṃśa.

source: སྐྱེས་མ་ཐག་ཏུ་དེ་དག་འདི་ལྟ་བུའི་ཚུལ་གྱི་སེམས་ཀྱི་རྣམ་པར་རྟོག་པ་སྐྱེས་ཏེ། བདག་ཅག་དགེ་བའི་ལས་ཀྱི་རྒྱུ་གང་གིས་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་ཀྱི་ནང་འདིར་སྐྱེས་སོ་སྙམ་མོ། །
en: As soon as they were born there, this manner of thought arose in their minds: ‘Through what good karma as a cause have we been reborn among the devas of Trāyastriṃśa?’

source: དེ་དག་ཡང་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་ཅག་འཛམ་བུའི་གླིང་དེ་ན་ཉ་ཁྲིར་གྱུར་ཏེ། བདག་ཅག་དུད་འགྲོའི་སྐྱེ་གནས་སུ་གྱུར་པ་ལས།
en: Then they thought, ‘We were ten thousand fish in Jambudvīpa.

source: ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་ཀྱིས། ཆུ་མང་པོ་དང་། ཁ་ཟས་ཀྱི་མཆོག་གིས་ཚིམ་པར་བྱས་ཏེ། བདག་ཅག་ལ་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཟབ་མོའི་ཆོས་ཀྱང་བསྟན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་གྱི་མཚན་ཡང་བསྒྲགས་པས།
en: We had been reborn as animals, but Jalavāhana, the head merchant’s son, satisfied us with much water and the most excellent food, and then he taught us the profound Dharma of dependent origination and recited the name of the tathāgata arhat samyaksaṃbuddha Ratnaśikhin.

source: དགེ་བའི་ཆོས་ཀྱི་རྒྱུ་དེ་དང་། རྐྱེན་དེས་བདག་ཅག་ལྷ་རྣམས་ཀྱི་ནང་འདིར་སྐྱེས་ཀྱིས།
en: It is through that good quality as a cause and as a condition that we have been reborn here among the Trāyastriṃśa devas.

source: བདག་ཅག་ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་ནས། དེ་ལ་མཆོད་པར་བྱའོ་སྙམ་ནས།
en: We must go to where Jalavāhana, the head merchant’s son, is and, after arriving there, make offerings to him.’

source: དེ་ནས་ལྷའི་བུ་ཁྲི་བོ་དེ་དག་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་ཀྱི་ནང་ནས། མི་སྣང་བར་གྱུར་ནས། ཚོང་དཔོན་གྱི་བུ་ཆུ་འབེབས་ཀྱི་ཁྱིམ་དུ་ལྷགས་ཏེ།
en: “Then those ten thousand devas vanished from among the Trāyastriṃśa devas and arrived at the home of Jalavāhana, the head merchant’s son.

source: དེའི་ཚེ་ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་མལ་ན་ཉལ་ཞིང་འདུག་པ་དེ་ལ། ལྷའི་བུ་དེ་དག་གིས་མུ་ཏིག་གི་སེ་མོ་དོ་ཁྲི་ནི་མགོའི་ཐད་ཀར་བཞག །
en: “At that time, Jalavāhana, the head merchant’s son, was sleeping on his bed, and those devas placed ten thousand pearl necklaces above his head.

source: མུ་ཏིག་གི་སེ་མོ་དོ་ཁྲི་ནི་རྐང་པའི་དྲུང་དུ་བཞག །
en: They placed a hundred thousand pearl necklaces in front of his feet.

source: མུ་ཏིག་གི་སེ་མོ་དོ་ཁྲི་ནི་གཡས་ལོགས་སུ་བཞག །
en: They placed a hundred thousand pearl necklaces to his right.

source: མུ་ཏིག་གི་སེ་མོ་དོ་ཁྲི་ནི་གཡོན་ལོགས་སུ་བཞག་སྟེ།
en: They placed a hundred thousand pearl necklaces to his left.

source: པུས་མོ་ནུབ་ཙམ་དུ་མེ་ཏོག་མན་དཱ་ར་བའི་ཆར་ཆེན་པོ་ཡང་ཕབ།
en: They also sent down a great rain of coral tree flowers that came up to the knees.

source: ལྷའི་སིལ་སྙན་རྣམས་ཀྱང་དཀྲོལ་ནས། དེས་འཛམ་བུའི་གླིང་པ་ཐམས་ཅད་གཉིད་ཀྱང་སད། ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་ཀྱང་སད་དོ། །
en: They also played divine music that woke up everyone in Jambudvīpa.

source: དེ་ནས་ལྷའི་བུ་ཁྲི་བོ་དེ་དག་ནམ་མཁའ་ལ་དོང་སྟེ། ལྷའི་བུ་དེ་དག་རྒྱལ་པོ་ལྷའི་དབང་ཕྱུག་འོད་ཀྱི་ཡུལ་གྱི་གནས་དང་། གནས་གཞན་དུ་ཡང་མེ་ཏོག་མན་དཱ་ར་བའི་ཆར་འབེབས་ཤིང་།
en: Then those ten thousand devas went up into the sky and sent down a rain of coral tree flowers here and there throughout the domain of King Sureśvaraprabha.

source: ནགས་ཁོང་ཁོང་ན་ཡོད་པའི་རྫིང་ཆེན་པོ་ག་ལ་བ་དེར་དོང་ནས། དེ་དག་གིས་རྫིང་ཆེན་པོ་དེར་མེ་ཏོག་མན་དཱ་ར་བའི་ཆར་ཆེན་པོ་མངོན་པར་ཕབ་སྟེ།
en: Then they went to the great lake in the empty wilderness and sent down a great rain of coral tree flowers onto that great lake.

source: དེ་ཉིད་དུ་མི་སྣང་བར་གྱུར་ནས་སླར་ཡང་ལྷའི་གནས་སུ་དོང་སྟེ། དེ་ན་འདོད་པའི་ཡོན་ཏན་ལྔ་པོ་དག་གིས་དགའ་ཞིང་རྩེ་སྟེ། དགའ་མགུར་སྤྱོད་ཅིང་དཔལ་དང་སྐལ་བ་བཟང་པོ་ཆེན་པོ་དག་ཀྱང་མྱོང་ངོ་། །
en: Then they vanished from there and returned to their paradise where they delighted and amused themselves with the five sensory pleasures, enjoyed pleasures, and experienced splendor and good fortune.

source: འཛམ་བུའི་གླིང་དུ་ནམ་ལངས་པ་དང་། དེ་ནས་རྒྱལ་པོ་ལྷའི་དབང་ཕྱུག་འོད་ཀྱིས་སྐར་མཁན་དང་། བློན་པོ་ཆེན་པོ་རྣམས་ལ་སྨྲས་པ། ཅིའི་ཕྱིར་མདང་སུམ་ལྟས་འདི་དག་བྱུང་།
en: “In Jambudvīpa, at dawn, King Sureśvaraprabha saw that these signs had occurred, and he asked his astrologers and prime ministers, ‘Why did these signs appear last night?’

source: དེ་དག་གིས་སྨྲས་པ། ལྷ་མཁྱེན་པར་མཛད་དུ་གསོལ། ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་ཀྱི་ཁྱིམ་དུ་མུ་ཏིག་གི་སེ་མོ་དོ་བཞི་ཁྲིའི་ཆར་བབ་ཅིང་། མེ་ཏོག་མན་དཱ་ར་བའི་ཆར་ཡང་བབ་པོ་ཞེས་བྱས་པ་དང་།
en: “They answered, ‘Your Majesty should know this: a rain of forty thousand pearl necklaces and also a rain of divine coral tree flowers fell in the home of Jalavāhana, the head merchant’s son.’

source: ཁྱེད་དེང་ལ་ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་ལ་སྙན་པའི་ཚིག་གིས་བོས་ཤིག །
en: “King Sureśvaraprabha said to his ministers, ‘You go and summon Jalavāhana, the head merchant’s son, with pleasant words.’

source: དེ་ནས་སྐར་མཁན་དང་། བློན་པོ་ཆེན་པོ་རྣམས་ཆུ་འབེབས་ཀྱི་ཁྱིམ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རྒྱལ་པོ་ལྷའི་དབང་ཕྱུག་འོད་ཁྱོད་ལ་འབོད་དོ། །
en: “Then the astrologers and prime ministers went to the home of Jalavāhana, the head merchant’s son, and having arrived they said to Jalavāhana, the head merchant’s son, ‘King Sureśvaraprabha is summoning you.’

source: དེ་ནས་ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་བློན་པོ་ཆེན་པོ་རྣམས་དང་ལྷན་ཅིག་ཏུ་རྒྱལ་པོ་ལྷའི་དབང་ཕྱུག་འོད་ག་ལ་བ་དེར་སོང་བ་དང་།
en: “Then Jalavāhana, the head merchant’s son, went with the prime ministers to King Sureśvaraprabha.

source: རྒྱལ་པོས་སྨྲས་པ།
en: “King Sureśvaraprabha said to him, ‘Jalavāhana, such kinds of signs appeared last night.

source: ཆུ་འབེབས་མདང་སུམ་དེ་འདྲ་བའི་ལྟས་བྱུང་བ་འདི་ཅིའི་ལྟས་ཤེས་སམ།
en: Do you know why there were those signs?’

source: དེ་ནས་ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་ཀྱིས་རྒྱལ་པོ་ལྷའི་དབང་ཕྱུག་འོད་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷ་བདག་གིས་འཚལ་ཏེ། ཉ་ཁྲི་པོ་དེ་དག་གུམ་པར་གྱུར་དུ་ངེས་སོ། །
en: “Then, Jalavāhana, the head merchant’s son, said to King Sureśvaraprabha, ‘Your Majesty, I know that the time of death definitely came for those ten thousand fish.’

source: རྒྱལ་པོས་སྨྲས་པ། ཇི་ལྟར་ཤེས།
en: “The king asked, ‘How do you know that, Jalavāhana?’

source: ཆུ་འབེབས་ཀྱིས་སྨྲས་པ།
en: “ ‘Your Majesty,’ said Jalavāhana.
